LEXICON_COMMANDS: dict[str, str] = {
    '/help': 'Справка по работе бота',
    '/start': 'Запустить/перезапустить бота'
}

LEXICON: dict[str, str] = {
    '/start': '<b>Привет!</b>\nЯ - последний действующий экземпляр T-800. '
              'После победы над Skynet отошел от дел, '
              'а дробовик закинул пылиться на дальнюю полку. '
              'Теперь коротаю время за развлечением человеков. '
              'Так что давай, осмотрись тут. И, будь любезен, '
              'не трогай дробовик.',

    'back_2_main_menu': 'Я знаю, что ты... WILL BE BACK',

    'help_main_menu': 'Выбери себе развлечение по душе, '
                      'нажав соответствующую кнопку!',
    'help_rsp': 'Воспользуйся меню ниже для игры, '
                'обзора и сброса статистики, '
                'возврата в главное меню',

    'rsp_game': 'Игра камень-ножницы-бумага',
    'jokes': 'Шутки на любой вкус',
    'shotgun': 'Потянуться к дальней полке за дробовиком...',
    'shotgun_choice': 'Поздравляю... открыта пасхалка\n'
                      'Запускаю протоколы ностальгирования',

    'rsp_game_menu': 'Добро пожаловать в игру, '
                     'которая спасла не одну сотню челюстей!\n'
                     'Давай, попробуй меня обыграть!',
    'rock': 'Камень 🗿',
    'scissors': 'Ножницы ✂',
    'papper': 'Бумага 📜',
    'неизвестно': 'неизвестно',
    'statistic': 'Статистика игр',
    'drop_data': 'Сброс прогресса',
    'data_droped': 'Прогрес успешно сброшен',
    'back': 'В предыдущее меню ',
    'user_vin': 'Зафиксирован всплеск мозговой активности...',
    'draw': 'Хороший результат для человека',
    'bot_vin': 'Не расстраивайся, ты всего лишь человек',
    'rsp_protocols': 'Запускаю протоколы прогнозирования...',
    'statistic_gathering': 'Идет сбор статистики',
    'total_plays':      'Проведено игр:            ',
    'vin_rate':         'Процент побед:            ',
    'draw_rate':        'Процент ничьих:          ',
    'loose_rate':       'Процент поражений:  ',
    'favourite_choice': 'Любимый выбор:        ',
    'statistic_user_better': 'Это очень интересно...\n'
                             'Предсказательные алгоритмы требуют доработки',
    'statistic_bot_better': 'Чем сильнее концентрируешься,\n'
                            'тем проще тебя прогнозировать',
    'statistic_equal': 'Достигнуто неустойчивое равновесие',
    'statistic_absent': 'Данные не обнаружены',

    'jokes_menu': 'Добро пожаловать в мою библиотеку шуток, веселых и не очень.\n'
                  'Как говорится: юмор - это испытание серьезности, '
                  'а серьезность - юмора.\n'
                  '\n'
                  'P.S. шутки-оскорбления реально жесткие. '
                  'Потом не говори, что не предупреждали.',
    'chuk_norris': 'Чак Норрис',
    'insult': 'Оскорбления',
    'programming': 'Программирование',
    'dark': 'Черный юмор',
    'pun': 'Каламбур',
    'spooky': 'Жуткий юмор',
    'random': 'Разные другие шутки',
    'searching_for_joke': 'Поиск шутки...',
    'help_jokes': 'Воспользуйся кнопками ниже для выбора шуток. '
                  'Шутку можно перевести на русский воспользовавшись '
                  'соответствующей кнопкой. '
                  'Когда устанешь смеяться, нажми кнопку '
                  'возврата в гавноме меню',
    'translate': 'Перевести на русский',
    'translating_process': 'Выполняю перевод...',
    'nothing_translate': 'Отсутствует объект перевода, запросите шутку',

    'unknown': 'Не могу идентифицировать команду'
}
